weather-api/app/services/weather_service/finder.rb

SELECT "weathers".* FROM "weathers" WHERE "weathers"."zip_code" = $1 AND "weathers"."day" = $2 LIMIT $3  [["zip_code", "L"], ["day", "2025-07-30"], ["LIMIT", 1]]
---
    def self.fetch_db(params)
      forecast = Weather.find_by({
        zip_code: params[:zip_code],
        day: Date.today
      })