weather-api/app/models/concerns/weather_concern.rb

    def create(weather)
      Weather.create!(weather)
---
INSERT INTO "weathers" ("zip_code", "day", "data", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"