weather-api/app/controllers/api/v1/weather_controller.rb

  def index
    forecasts = Weather.all
---
SELECT "weathers".* FROM "weathers"